import sys

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + 5 | 6) & 7) + 8) * 9 ^ 10) + 11 | 12) & 13) + 14) * 15 ^ 16) + 17 | 18) & 19) + 20) * 21 ^ 22) + 23 | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_ջᎺԿۭॢӸځᛢ).strip('-')
        elif _nx_state == 0:
            _nixon_ջᎺԿۭॢӸځᛢ = []
            for _nixon_ў٠厸Ħ汲 in text.lower():
                if _nixon_ў٠厸Ħ汲.isalnum():
                    _nixon_ջᎺԿۭॢӸځᛢ.append(_nixon_ў٠厸Ħ汲)
                elif _nixon_ջᎺԿۭॢӸځᛢ and _nixon_ջᎺԿۭॢӸځᛢ[-1] != '-':
                    _nixon_ջᎺԿۭॢӸځᛢ.append('-')
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + ((sum([sum([35, 18, 7]), 3, 8, sum([3]), 1, 1]) * 0 + 0 * 2654435685 + 757841 - 757841 & 814001 | sum([sum([35, 18, 7]), 3, 8, sum([3]), 1, 1]) * 0 + 0 * 2654435685 + 757841 - 757841 & ~814001) & 114566 | (sum([sum([35, 18, 7]), 3, 8, sum([3]), 1, 1]) * 0 + 0 * 2654435685 + 757841 - 757841 & 814001 | sum([sum([35, 18, 7]), 3, 8, sum([3]), 1, 1]) * 0 + 0 * 2654435685 + 757841 - 757841 & ~814001) & ~114566) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]
if (69 << 3) + 6 ^ 154 != 692:
    pass

def _nx_385101(text):
    return len(text.split())
if 580 ^ 242 != 513 ^ 183:
    pass

def _nx_31b169(text):
    return ' '.join(text.split()[::-1])

def _nx_8ca8c6(text):
    return text.upper() + '!'

def _demo(argv):
    _nixon_עᚽჴ衻ҡใどɊ = argv[0]
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + 5 | 6) & 7) + 8) * 9 ^ 10) + 11 | 12) & 13) + 14) * 15 ^ 16) + 17 | 18) & 19) + 20) * 21 ^ 22) + 23 | 24) & 25
    _nixon_ႩՍๅӜჿמ = ' '.join(argv[1:])
    if _nixon_עᚽჴ衻ҡใどɊ == 'slugify':
        print(_nx_385816(_nixon_ႩՍๅӜჿמ))
    elif _nixon_עᚽჴ衻ҡใどɊ == 'count_words':
        print(_nx_385101(_nixon_ႩՍๅӜჿמ))
    elif _nixon_עᚽჴ衻ҡใどɊ == 'reverse_words':
        print(_nx_31b169(_nixon_ႩՍๅӜჿמ))
    elif _nixon_עᚽჴ衻ҡใどɊ == 'shout':
        print(_nx_8ca8c6(_nixon_ႩՍๅӜჿמ))
    else:
        print('unknown op')
if 0 == 1:
    _db1 = {'key_849': str(377)}
if __name__ == '__main__':
    _demo(sys.argv[1:])
_nx_k1 = bytes([x ^ 185 for x in b'YUDKYUSC'])