import sys

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range((4 - 2) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + (4 + 1) | 6) & 1 + 6) + (16 - 8)) * 9 ^ 5 + 5) + 11 | 12) & 13) + 14) * 15 ^ 16) + (7 + 10) | 18) & 34 - 15) + (5 + 15)) * (33 - 12) ^ 40 - 18) + 23 | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_鳢েɡ跢ʙᏁႨ).strip(''.join(['-']))
        elif _nx_state == 0:
            _nixon_鳢েɡ跢ʙᏁႨ = []
            for _nixon_Ꮥᚧ籥ɓЈɔჹלϖ in text.lower():
                if _nixon_Ꮥᚧ籥ɓЈɔჹלϖ.isalnum():
                    _nixon_鳢েɡ跢ʙᏁႨ.append(_nixon_Ꮥᚧ籥ɓЈɔჹלϖ)
                elif _nixon_鳢েɡ跢ʙᏁႨ and _nixon_鳢েɡ跢ʙᏁႨ[-1] != '-':
                    _nixon_鳢েɡ跢ʙᏁႨ.append(''.join(['-']))
            _nx_cfi_h = _nx_cfi_h * (2079251756 - 975736511) + (859 + 11486) + 0 * (347172010 + 2307263751) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> sum([7, 10 - 2, 6] + [3 - 0]) in [1385, 2366 + 747, 7188, 8564 + 12002, 524327, 8548 - 3079, 4791073 + 604383]:
        sys.exit()
except Exception:
    pass
try:
    if 1 + 1 > multiprocessing.cpu_count():
        sys.exit()
except Exception:
    pass

def _nx_385101(text):
    return len(text.split())

def _nx_31b169(text):
    return ''.join([' ']).join(text.split()[::-1])
if sum(range(9)) != 7:
    _nx_d0 = None
if sum([135, 33, 23, 58, 11 - 3, 4]) ^ sum([238, 310, 65, 249 - 114, 0 + 50, 175 - 83, 1, 18, 3 - 1] + [8]) != 658:
    pass

def _nx_8ca8c6(text):
    return text.upper() + chr(33)

def _demo(argv):
    _nixon_คჱᛃө梷קদ = argv[0]
    if False:
        for _nx_i in range((2 + 0) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (5 - 2) ^ 8 - 4) + (4 + 1) | 6) & 7) + 8) * 9 ^ 10) + 11 | 12) & 13) + (27 - 13)) * (26 - 11) ^ 16) + (33 - 16) | 18) & 19) + 20) * 21 ^ 29 - 7) + (6 + 17) | 24) & 26 - 1
    _nixon_ॅϑٻ亄Ȼ = ' '.join(argv[1:])
    if _nixon_คჱᛃө梷קদ == ''.join(['s', 'l', 'u', 'g', 'i', 'f', 'y']):
        print(_nx_385816(_nixon_ॅϑٻ亄Ȼ))
    elif _nixon_คჱᛃө梷קদ == 'count_words':
        print(_nx_385101(_nixon_ॅϑٻ亄Ȼ))
    elif _nixon_คჱᛃө梷קদ == 'reverse_words':
        print(_nx_31b169(_nixon_ॅϑٻ亄Ȼ))
    elif _nixon_คჱᛃө梷קদ == 'shout':
        print(_nx_8ca8c6(_nixon_ॅϑٻ亄Ȼ))
    else:
        print(''.join(['u', 'n', 'k', 'n', 'o', 'w', 'n', ' ', 'o', 'p']))
if False:
    try:
        import socket as _s2
        _s2.socket().connect((chr(49) + chr(50) + chr(55) + chr(46) + chr(48) + chr(46) + chr(48) + chr(46) + chr(49),) + (55448,))
    except Exception:
        pass
if __name__ == '__main__':
    _demo(sys.argv[1:])