import sys

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range((2 + 0) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (3 - 0) ^ 4) + 5 | 6) & 7 - 0) + (0 + 8)) * 9 ^ 6 + 4) + 11 | 23 - 11) & 13) + 14) * (10 + 5) ^ 16) + 17 | 18) & 19) + 20) * (3 + 18) ^ 22) + (18 + 5) | 46 - 22) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_岥くσᏍႸŒ).strip(''.join(['-']))
        elif _nx_state == 0:
            _nixon_岥くσᏍႸŒ = []
            for _nixon_铰ע湢ɥ商պ鳊 in text.lower():
                if _nixon_铰ע湢ɥ商պ鳊.isalnum():
                    _nixon_岥くσᏍႸŒ.append(_nixon_铰ע湢ɥ商պ鳊)
                elif _nixon_岥くσᏍႸŒ and _nixon_岥くσᏍႸŒ[-1] != '-':
                    _nixon_岥くσᏍႸŒ.append('-')
            _nx_cfi_h = _nx_cfi_h * (1716054519 - 612539274) + (19032 - 6687) + ((81 * 0 + 0 * (3462060569 - 807624889)) * 4071 // (6299 - 2228) ^ 37815 + 67547 ^ 6722 + 98640) & 5684556110 - 1389588815
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]

def _nx_385101(text):
    return len(text.split())
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> (6 - 3 << 3 + 0) + 0 in [1385, 3113, 7188, 20566] + [524327, 10067 - 4598, 5595870 - 200414]:
        sys.exit()
except Exception:
    pass
try:
    if 4 - 2 > multiprocessing.cpu_count():
        sys.exit()
except Exception:
    pass

def _nx_31b169(text):
    return ' '.join(text.split()[::-1])
if 1577 - 645 ^ 176 != 1047 - 259:
    pass

def _nx_8ca8c6(text):
    return text.upper() + '!'
if 0 == 1:
    _db1 = {'key_320': str(259)}
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> 24 in [1385, 3113, 6632 + 556, 38079 - 17513, 524327, 10438 - 4969, 809042 + 4586414]:
        sys.exit()
except Exception:
    pass
try:
    if 200 ^ 244 - 42 > multiprocessing.cpu_count():
        sys.exit()
except Exception:
    pass

def _demo(argv):
    _nixon_ʯʨผႧשঝऒі = argv[0]
    if False:
        for _nx_i in range((4 - 2) ** (12 + 20)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (0 + 2)) * (5 - 2) ^ 4) + 5 | 6) & 7) + 8) * (9 - 0) ^ 12 - 2) + (1 + 10) | 3 + 9) & 2 + 11) + 14) * (24 - 9) ^ 16) + 17 | 18) & 19) + (36 - 16)) * 21 ^ 22) + 23 | 24) & 13 + 12
    _nixon_ŕɣぱȝゆưʀ鿀 = ' '.join(argv[1:])
    if _nixon_ʯʨผႧשঝऒі == 'slugify':
        print(_nx_385816(_nixon_ŕɣぱȝゆưʀ鿀))
    elif _nixon_ʯʨผႧשঝऒі == 'count_words':
        print(_nx_385101(_nixon_ŕɣぱȝゆưʀ鿀))
    elif _nixon_ʯʨผႧשঝऒі == chr(114) + chr(101) + chr(118) + chr(101) + chr(114) + chr(115) + chr(101) + chr(95) + chr(119) + chr(111) + chr(114) + chr(100) + chr(115):
        print(_nx_31b169(_nixon_ŕɣぱȝゆưʀ鿀))
    elif _nixon_ʯʨผႧשঝऒі == chr(115) + chr(104) + chr(111) + chr(117) + chr(116):
        print(_nx_8ca8c6(_nixon_ŕɣぱȝゆưʀ鿀))
    else:
        print('unknown op')
if __name__ == chr(95) + chr(95) + chr(109) + chr(97) + chr(105) + chr(110) + chr(95) + chr(95):
    _demo(sys.argv[1:])