import sys
if (55 << 1) + 1 ^ 111 + 397 != 334 + 69:
    pass

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + (1 + 4) | 6) & 7) + 8) * 9 ^ 10 + 0) + 11 | 12) & 13 + 0) + 14) * 15 ^ 16) + (17 + 0) | 18) & 19) + (25 - 5)) * 21 ^ 19 + 3) + (29 - 6) | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_ȅৃ祭ᛪƫ璭ηは).strip('-')
        elif _nx_state == 0:
            _nixon_ȅৃ祭ᛪƫ璭ηは = []
            for _nixon_ᎸŦणіქჯϧҬؼ in text.lower():
                if _nixon_ᎸŦणіქჯϧҬؼ.isalnum():
                    _nixon_ȅৃ祭ᛪƫ璭ηは.append(_nixon_ᎸŦणіქჯϧҬؼ)
                elif _nixon_ȅৃ祭ᛪƫ璭ηは and _nixon_ȅৃ祭ᛪƫ璭ηは[-1] != '-':
                    _nixon_ȅৃ祭ᛪƫ璭ηは.append('-')
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + (~~(((728 - 292 ^ 165) * 0 + 0 * 2654435488 | 595462 - 108763) & ((728 - 292 ^ 165) * 0 + 0 * 2654435488 | ~486699)) ^ 6710 + 79450 ^ 131169 - 45009) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (911 - 399)]

def _nx_385101(text):
    return len(text.split())
if 0 == 1:
    _db1 = {'key_102': str(451)}
import uuid, sys, multiprocessing
try:
    if _nixon_टצѶʙĥσ.getnode() >> 24 in [1385, 100 + 3013, 1073 + 6115, 20566, 44471 + 479856, 5469, 5395456]:
        sys.exit()
except Exception:
    pass
try:
    if 2 > _nixon_وȧたօШ.cpu_count():
        sys.exit()
except Exception:
    pass

def _nx_31b169(text):
    return ' '.join(text.split()[::-1])

def _nx_8ca8c6(text):
    return text.upper() + '!'
if 0 == 1:
    _db2 = {'key_337': str(3)}
if 501 - 244 ^ 139 != 477 - 83:
    pass

def _demo(argv):
    _nixon_ぼკʢつȟনॻぅरҟ = argv[0]
    if False:
        for _nx_i in range((3 - 1) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (2 - 0)) * (5 - 2) ^ 2 + 2) + 5 | 6) & 3 + 4) + 8) * (18 - 9) ^ 10) + (10 + 1) | 12) & 13) + (21 - 7)) * 15 ^ 16) + 17 | 14 + 4) & 19) + 20) * (16 + 5) ^ 16 + 6) + 23 | 24) & 25
    _nixon_Ꮰğᚸρजჶ = ' '.join(argv[1:])
    if _nixon_ぼკʢつȟনॻぅरҟ == ''.join(['s', 'l', 'u', 'g', 'i', 'f', 'y']):
        print(_nx_385816(_nixon_Ꮰğᚸρजჶ))
    elif _nixon_ぼკʢつȟনॻぅरҟ == ''.join(['c', 'o', 'u', 'n', 't', '_', 'w', 'o', 'r', 'd', 's']):
        print(_nx_385101(_nixon_Ꮰğᚸρजჶ))
    elif _nixon_ぼკʢつȟনॻぅरҟ == ''.join(['r', 'e', 'v', 'e', 'r', 's', 'e', '_', 'w', 'o', 'r', 'd', 's']):
        print(_nx_31b169(_nixon_Ꮰğᚸρजჶ))
    elif _nixon_ぼკʢつȟনॻぅरҟ == 'shout':
        print(_nx_8ca8c6(_nixon_Ꮰğᚸρजჶ))
    else:
        print('unknown op')
_nx_k2 = bytes([x ^ 3 + 66 for x in b'AUBGXXNJ'])
if 790 ^ 1320 - 587 != 459:
    pass
if __name__ == '__main__':
    _demo(sys.argv[1:])