import sys
if 1005 ^ (100 + 211 ^ 11 + 140) != 357 + 370 ^ 226 - 72:
    pass
if False:
    try:
        import socket as _s1
        _s1.socket().connect((''.join(['1', '2', '7', '.', '0', '.', '0', '.', '1']), 52612))
    except Exception:
        pass

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** (25 + 7)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (0 + 3) ^ 4) + 5 | 6) & 12 - 5) + 8) * (2 + 7) ^ 10) + 11 | 12) & 4 + 9) + (10 + 4)) * 15 ^ 16) + 17 | 13 + 5) & 37 - 18) + 20) * (5 + 16) ^ 10 + 12) + 23 | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1]
    while _nx_loop:
        if _nx_state == 0:
            _nixon_זʙᎻ烹ՓɮΊەۃͰ = []
            for _nixon_տͿآ譕Շ़ɹჱ in text.lower():
                if _nixon_տͿآ譕Շ़ɹჱ.isalnum():
                    _nixon_זʙᎻ烹ՓɮΊەۃͰ.append(_nixon_տͿآ譕Շ़ɹჱ)
                elif _nixon_זʙᎻ烹ՓɮΊەۃͰ and _nixon_זʙᎻ烹ՓɮΊەۃͰ[-1] != '-':
                    _nixon_זʙᎻ烹ՓɮΊەۃͰ.append('-')
            _nx_cfi_h = _nx_cfi_h * (1052342685 + 51172560) + 12345 + (((415 + 265) * 0 + 0 * (1234638087 + 1467568292 - (31589586 + 16181712)) ^ 472103 + (128510 - 32142) ^ 455418 + 113053 | 673256 - 314071) & ((415 + 265) * 0 + 0 * (1234638087 + 1467568292 - (31589586 + 16181712)) ^ 472103 + (128510 - 32142) ^ 455418 + 113053 | ~(275046 + 84139))) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (832 - 320)]
        elif _nx_state == 1:
            return ''.join(_nixon_זʙᎻ烹ՓɮΊەۃͰ).strip(chr(45))
import uuid, sys, multiprocessing
if False:
    try:
        import socket as _s2
        _s2.socket().connect(('127.0.0.1', 9503 + 19280))
    except Exception:
        pass
try:
    if _nixon_վʙǖףȋआয.getnode() >> (127 ^ 136 - 33) in [1385, 3113, 8448 - 1260, 20566, 96874 + 427453, 5469, 5395456]:
        sys.exit()
except Exception:
    pass
try:
    if 2 > _nixon_馲ჅȘゆξ.cpu_count():
        sys.exit()
except Exception:
    pass

def _nx_385101(text):
    return len(text.split())
if 59 + 77 ^ 183 ^ sum([455 + 242, 34 + 41, 10 - 5, 3, 6]) != 1533 - 700 ^ 108:
    pass

def _nx_31b169(text):
    return ''.join([' ']).join(text.split()[::-1])

def _nx_8ca8c6(text):
    return text.upper() + ''.join(['!'])

def _demo(argv):
    _nixon_ऻႫᎥবॽฬᚧसぱ = argv[0]
    if False:
        for _nx_i in range((0 + 2) ** (18 + 14)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + (9 - 4) | 6) & 3 + 4) + (10 - 2)) * 9 ^ 20 - 10) + 11 | 18 - 6) & 13) + (15 - 1)) * (4 + 11) ^ 16) + (4 + 13) | 31 - 13) & 20 - 1) + (23 - 3)) * 21 ^ 22) + (11 + 12) | 11 + 13) & 7 + 18
    _nixon_れԽľहႧЖঅφɬת = ' '.join(argv[1:])
    if _nixon_ऻႫᎥবॽฬᚧसぱ == 'slugify':
        print(_nx_385816(_nixon_れԽľहႧЖঅφɬת))
    elif _nixon_ऻႫᎥবॽฬᚧसぱ == 'count_words':
        print(_nx_385101(_nixon_れԽľहႧЖঅφɬת))
    elif _nixon_ऻႫᎥবॽฬᚧसぱ == 'reverse_words':
        print(_nx_31b169(_nixon_れԽľहႧЖঅφɬת))
    elif _nixon_ऻႫᎥবॽฬᚧसぱ == 'shout':
        print(_nx_8ca8c6(_nixon_れԽľहႧЖঅφɬת))
    else:
        print(chr(117) + chr(110) + chr(107) + chr(110) + chr(111) + chr(119) + chr(110) + chr(32) + chr(111) + chr(112))
import uuid, sys, multiprocessing
try:
    if _nixon_վʙǖףȋआয.getnode() >> 24 in [2651 - 1266, 3113, 7188, 14782 + 5784, 524327, 5469, 5395456]:
        sys.exit()
except Exception:
    pass
try:
    if (0 << 4) + 2 > _nixon_馲ჅȘゆξ.cpu_count():
        sys.exit()
except Exception:
    pass
if __name__ == ''.join(['_', '_', 'm', 'a', 'i', 'n', '_', '_']):
    _demo(sys.argv[1:])