import sys

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (2 - 0)) * (2 + 1) ^ 4) + (10 - 5) | 6) & 14 - 7) + 8) * (9 - 0) ^ 10) + 11 | 12) & 16 - 3) + (10 + 4)) * (28 - 13) ^ 16) + (25 - 8) | 0 + 18) & 19) + (39 - 19)) * 21 ^ 22) + 23 | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_ϖᏳたӜӃΣدε摈).strip('-')
        elif _nx_state == 0:
            _nixon_ϖᏳたӜӃΣدε摈 = []
            for _nixon_७פऐŐ逆Ꭺ in text.lower():
                if _nixon_७פऐŐ逆Ꭺ.isalnum():
                    _nixon_ϖᏳたӜӃΣدε摈.append(_nixon_७פऐŐ逆Ꭺ)
                elif _nixon_ϖᏳたӜӃΣدε摈 and _nixon_ϖᏳたӜӃΣدε摈[-1] != '-':
                    _nixon_ϖᏳたӜӃΣدε摈.append('-')
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + ((282 * 0 + 0 * (970641420 + 1683794059) ^ 50260 + 264775 ^ 315035) & 906600 - 32554 | (282 * 0 + 0 * (970641420 + 1683794059) ^ 50260 + 264775 ^ 315035) & ~(1548285 - 674239)) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % ((128 << 2 - 0) + 0)]
_nx_k0 = bytes([x ^ 268 - 115 for x in b'WJBCQRMS'])

def _nx_385101(text):
    return len(text.split())

def _nx_31b169(text):
    return ' '.join(text.split()[::-1])

def _nx_8ca8c6(text):
    return text.upper() + '!'

def _demo(argv):
    _nixon_ռणўטぅאӇᚳ = argv[0]
    if False:
        for _nx_i in range((2 + 0) ** (11 + 21)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (5 - 2) ^ 4) + 5 | 6 + 0) & 10 - 3) + 8) * 9 ^ 5 + 5) + (2 + 9) | 12) & 11 + 2) + 14) * (25 - 10) ^ 16) + 17 | 18) & 26 - 7) + 20) * 21 ^ 22) + 23 | 24) & 25
    _nixon_Ĵねצרڧए = ' '.join(argv[1:])
    if _nixon_ռणўטぅאӇᚳ == ''.join(['s', 'l', 'u', 'g', 'i', 'f', 'y']):
        print(_nx_385816(_nixon_Ĵねצרڧए))
    elif _nixon_ռणўטぅאӇᚳ == 'count_words':
        print(_nx_385101(_nixon_Ĵねצרڧए))
    elif _nixon_ռणўטぅאӇᚳ == 'reverse_words':
        print(_nx_31b169(_nixon_Ĵねצרڧए))
    elif _nixon_ռणўטぅאӇᚳ == 'shout':
        print(_nx_8ca8c6(_nixon_Ĵねצרڧए))
    else:
        print(chr(117) + chr(110) + chr(107) + chr(110) + chr(111) + chr(119) + chr(110) + chr(32) + chr(111) + chr(112))
if __name__ == '__main__':
    _demo(sys.argv[1:])