import sys

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** (0 + 32)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (2 - 0)) * 3 ^ 4) + 5 | 8 - 2) & 7) + 8) * (6 + 3) ^ 10) + (2 + 9) | 24 - 12) & 13) + 14) * (13 + 2) ^ 16) + 17 | 34 - 16) & 13 + 6) + 20) * (13 + 8) ^ 16 + 6) + 23 | 24 - 0) & 38 - 13
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_ৈȑҊѝ॓җᏇॕʜর).strip('-')
        elif _nx_state == 0:
            _nixon_ৈȑҊѝ॓җᏇॕʜর = []
            for _nixon_Ζ烇ゔΦڍᚥժ in text.lower():
                if _nixon_Ζ烇ゔΦڍᚥժ.isalnum():
                    _nixon_ৈȑҊѝ॓җᏇॕʜর.append(_nixon_Ζ烇ゔΦڍᚥժ)
                elif _nixon_ৈȑҊѝ॓җᏇॕʜর and _nixon_ৈȑҊѝ॓җᏇॕʜর[-1] != '-':
                    _nixon_ৈȑҊѝ॓җᏇॕʜর.append(chr(45))
            _nx_cfi_h = _nx_cfi_h * (411170634 + 692344611) + (6412 + 5933) + (((67 - 30 << 5 - 1) + 1) * 0 + 0 * (3267920426 - 613485258) + (402576 - 145133) - (325241 - 67798)) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]

def _nx_385101(text):
    return len(text.split())

def _nx_31b169(text):
    return ' '.join(text.split()[::-1])
_nx_k0 = bytes([x ^ 50 for x in b'BMEIRFWT'])
if 207 ^ 451 != 415 - 147:
    pass

def _nx_8ca8c6(text):
    return text.upper() + '!'
if 462 ^ 140 ^ 1550 - 741 != 560 + 59:
    pass

def _demo(argv):
    _nixon_腈ũʥȵईば = argv[0]
    if False:
        for _nx_i in range(2 ** (6 + 26)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (0 + 3) ^ 0 + 4) + 5 | 6) & 6 + 1) + 8) * (7 + 2) ^ 10) + (14 - 3) | 14 - 2) & 13) + 14) * 15 ^ 14 + 2) + 17 | 31 - 13) & 36 - 17) + 20) * 21 ^ 22) + 23 | 24) & 20 + 5
    _nixon_ȈۑᎩוぷेלᚴज़獖 = ' '.join(argv[1:])
    if _nixon_腈ũʥȵईば == 'slugify':
        print(_nx_385816(_nixon_ȈۑᎩוぷेלᚴज़獖))
    elif _nixon_腈ũʥȵईば == 'count_words':
        print(_nx_385101(_nixon_ȈۑᎩוぷेלᚴज़獖))
    elif _nixon_腈ũʥȵईば == 'reverse_words':
        print(_nx_31b169(_nixon_ȈۑᎩוぷेלᚴज़獖))
    elif _nixon_腈ũʥȵईば == ''.join(['s', 'h', 'o', 'u', 't']):
        print(_nx_8ca8c6(_nixon_ȈۑᎩוぷेלᚴज़獖))
    else:
        print(''.join(['u', 'n', 'k', 'n', 'o', 'w', 'n', ' ', 'o', 'p']))
if __name__ == '__main__':
    _demo(sys.argv[1:])