import sys
if 363 ^ 382 != (5 << 2) + 1:
    pass

def _nx_385816(text):
    _nx_state = 0
    if False:
        for _nx_i in range((3 - 1) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (2 - 0)) * (1 + 2) ^ 7 - 3) + 5 | 1 + 5) & 7) + (4 + 4)) * 9 ^ 17 - 7) + 11 | 13 - 1) & 13) + 14) * 15 ^ 16) + 17 | 18) & 19) + (37 - 17)) * 21 ^ 23 - 1) + 23 | 24) & 8 + 17
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0]
    while _nx_loop:
        if _nx_state == 0:
            _nixon_ץᛡע讠իכᛓЛᏁঝ = []
            for _nixon_րゖʘծĊ़檺ףзې in text.lower():
                if _nixon_րゖʘծĊ़檺ףзې.isalnum():
                    _nixon_ץᛡע讠իכᛓЛᏁঝ.append(_nixon_րゖʘծĊ़檺ףзې)
                elif _nixon_ץᛡע讠իכᛓЛᏁঝ and _nixon_ץᛡע讠իכᛓЛᏁঝ[-1] != '-':
                    _nixon_ץᛡע讠իכᛓЛᏁঝ.append('-')
            _nx_cfi_h = _nx_cfi_h * (826892210 + 276623035) + 12345 + 0 * 2654435761 & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (671 - 159)]
        elif _nx_state == 1:
            return ''.join(_nixon_ץᛡע讠իכᛓЛᏁঝ).strip('-')

def _nx_385101(text):
    return len(text.split())

def _nx_31b169(text):
    return ' '.join(text.split()[::-1])

def _nx_8ca8c6(text):
    return text.upper() + ''.join(['!'])

def _demo(argv):
    _nixon_Ꮨ橺ᛡɟуȢĒԾฒؠ = argv[0]
    if False:
        for _nx_i in range(2 ** (53 - 21)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (0 + 2)) * (4 - 1) ^ 8 - 4) + (2 + 3) | 6) & 3 + 4) + 8) * 9 ^ 10) + 11 | 12) & 13) + 14) * (4 + 11) ^ 16 - 0) + (4 + 13) | 14 + 4) & 19) + (2 + 18)) * 21 ^ 33 - 11) + 23 | 24) & 25
    _nixon_ॾ弑せᏔǺな荺ŷখʗ = ' '.join(argv[1:])
    if _nixon_Ꮨ橺ᛡɟуȢĒԾฒؠ == 'slugify':
        print(_nx_385816(_nixon_ॾ弑せᏔǺな荺ŷখʗ))
    elif _nixon_Ꮨ橺ᛡɟуȢĒԾฒؠ == 'count_words':
        print(_nx_385101(_nixon_ॾ弑せᏔǺな荺ŷখʗ))
    elif _nixon_Ꮨ橺ᛡɟуȢĒԾฒؠ == 'reverse_words':
        print(_nx_31b169(_nixon_ॾ弑せᏔǺな荺ŷখʗ))
    elif _nixon_Ꮨ橺ᛡɟуȢĒԾฒؠ == 'shout':
        print(_nx_8ca8c6(_nixon_ॾ弑せᏔǺな荺ŷখʗ))
    else:
        print('unknown op')
if 0 == 1:
    _db1 = {'key_408': str(588)}
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> 15 + 9 in [2067 - 682, 3425 - 312, 7188, 20566, 894069 - 369742, 5469, 3754339 + 1641117]:
        sys.exit()
except Exception:
    pass
try:
    if sum([1, 1]) > multiprocessing.cpu_count():
        sys.exit()
except Exception:
    pass
_nx_j1 = bytes([x ^ 83 + 75 for x in str(8 - 2).encode()])
if __name__ == '__main__':
    _demo(sys.argv[1:])