import sys
import uuid, sys, multiprocessing
try:
    if _nixon_Ⴅか枎Ⴁ閾ɸկঢĐუ.getnode() >> 21 + 3 in [1385, 3113, 7188, 31288 - 10722, 524327] + [5847 - 378, 6828951 - 1433495]:
        sys.exit()
except Exception:
    pass
try:
    if 2 + 0 > _nixon_ฐƂঢȎぷףᚻזȵ.cpu_count():
        sys.exit()
except Exception:
    pass

def _nx_049ebf(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** (48 - 16)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (2 + 0)) * 3 ^ 6 - 2) + 5 | 6) & 0 + 7) + (4 + 4)) * 9 ^ 5 + 5) + 11 | 2 + 10) & 10 + 3) + (6 + 8)) * (30 - 15) ^ 16) + 17 | 18) & 30 - 11) + 20) * 21 ^ 22) + 23 | 42 - 18) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [2, 1, 0, 2, 0, 0, 2, 2, 0, 2, 1, 1, 2, 2, 0, 1, 2, 1, 1, 2, 0, 1, 0, 2, 1, 2, 0, 2, 1, 1, 0, 0, 0, 1, 1, 2, 2, 2, 1, 1, 0, 0, 0, 2, 2, 1, 1, 2, 1, 1, 2, 1, 0, 2, 1, 0, 1, 1, 0, 1, 2, 0, 1, 0, 0, 1, 2, 1, 2, 2, 2, 1, 2, 2, 0, 1, 1, 0, 0, 1, 2, 2, 0, 2, 1, 2, 0, 1, 2, 1, 1, 2, 2, 2, 2, 1, 2, 1, 2, 0, 0, 2, 0, 2, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 2, 0, 2, 2, 2, 2, 0, 1, 1, 2, 2, 2, 0, 0, 1, 1, 0, 0, 2, 2, 2, 1, 1, 2, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 2, 1, 0, 1, 0, 2, 2, 0, 0, 0, 0, 0, 2, 1, 2, 2, 2, 0, 1, 1, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 1, 0, 2, 2, 1, 2, 2, 2, 2, 2, 2, 0, 1, 1, 0, 0, 1, 1, 2, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 2, 1, 2, 1, 0, 2, 2, 0, 1, 2, 0, 1, 1, 2, 2, 2, 2, 0, 1, 2, 1, 2, 0, 0, 2, 0, 2, 1, 2, 1, 1, 1, 2, 1, 0, 0, 0, 0, 2, 0, 1, 1, 2, 2, 2, 0, 0, 2, 2, 0, 1, 2, 1, 2, 1, 2, 0, 0, 1, 1, 2, 2, 2, 2, 2, 1, 0, 2, 1, 1, 2, 2, 2, 2, 2, 2, 1, 1, 0, 2, 0, 1, 1, 1, 0, 2, 0, 1, 2, 0, 1, 0, 2, 0, 1, 0, 0, 1, 2, 0, 0, 1, 1, 1, 0, 2, 2, 1, 1, 2, 1, 1, 1, 2, 0, 1, 1, 2, 2, 1, 1, 2, 1, 2, 0, 2, 2, 2, 0, 0, 0, 0, 2, 2, 0, 0, 2, 1, 1, 2, 2, 0, 1, 0, 0, 0, 0, 2, 2, 0, 2, 2, 1, 1, 0, 2, 2, 2, 0, 1, 2, 0, 2, 0, 1, 2, 2, 2, 0, 2, 1, 1, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 0, 1, 0, 2, 0, 1, 2, 2, 2, 0, 0, 0, 0, 2, 1, 2, 2, 0, 2, 0, 1, 0, 2, 1, 1, 2, 2, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 2, 1, 2, 0, 2, 2, 1, 0, 1, 1, 2, 2, 2, 0, 0, 0, 0, 0, 1, 2, 2, 2, 2, 1, 1, 2, 2, 1, 2, 2, 0, 2, 1, 0, 1, 1, 0, 2, 1, 0, 1, 1, 1, 1, 1, 2, 1, 0, 0, 1, 0, 2, 2, 0, 1]
    while _nx_loop:
        if _nx_state == 0:
            if not text:
                return ''
            _nx_cfi_h = _nx_cfi_h * (927882482 + 175632763) + 12345 + ((522 * 0 + 0 * (1015999745 + 1638435494) ^ 19760 ^ 23792 - 4032) + (992548 - 376585) - (50713 + 565250)) & 1396043290 + 2898924005
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]
        elif _nx_state == 1:
            _nixon_ᛡʌჇᏕضᏕ = []
            run = text[0]
            _nixon_הƽᏘႰᎼᎾᚥ = 1
            for _nixon_ᚠūธႺᏮॶ in text[1:]:
                if _nixon_ᚠūธႺᏮॶ == run[-1] and sum([1, 1, 3 + 1, 2 - 0, 1]) > _nixon_הƽᏘႰᎼᎾᚥ:
                    _nixon_הƽᏘႰᎼᎾᚥ += 1
                else:
                    _nixon_ᛡʌჇᏕضᏕ.append(run[-1] + str(_nixon_הƽᏘႰᎼᎾᚥ))
                    run = _nixon_ᚠūธႺᏮॶ
                    _nixon_הƽᏘႰᎼᎾᚥ = 1
            _nx_cfi_h = _nx_cfi_h * 1103515245 + (14927 - 2582) + 1 * (5128635480 - 2474199719) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (252 + 260)]
        elif _nx_state == 2:
            _nixon_ᛡʌჇᏕضᏕ.append(run[-1] + str(_nixon_הƽᏘႰᎼᎾᚥ))
            return ''.join(_nixon_ᛡʌჇᏕضᏕ)
_nx_k0 = bytes([x ^ 42 for x in b'PIRYFRAI'])
if 1019 ^ sum([0 + 61, 87, 66 - 32, 42, 1, 1]) != 793:
    pass

def _nx_b27c0a(code):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (3 - 1)) * (1 + 2) ^ 4) + 5 | 6) & 7) + (8 - 0)) * (6 + 3) ^ 9 + 1) + 11 | 12) & 13) + 14) * (5 + 10) ^ 16 + 0) + 17 | 18) & 33 - 14) + (24 - 4)) * (20 + 1) ^ 33 - 11) + (36 - 13) | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0]
    while _nx_loop:
        if _nx_state == 0:
            _nixon_ᛡʌჇᏕضᏕ = []
            _nixon_Ⴠגאঋऋ๊ = 0
            while len(code) > _nixon_Ⴠגאঋऋ๊:
                _nixon_ᚠūธႺᏮॶ = code[_nixon_Ⴠגאঋऋ๊]
                _nixon_χँΖৈסႧႹטսथ = int(code[_nixon_Ⴠגאঋऋ๊ + 1])
                _nixon_ᛡʌჇᏕضᏕ.append(_nixon_ᚠūธႺᏮॶ * _nixon_χँΖৈסႧႹטսथ)
                _nixon_Ⴠגאঋऋ๊ += 2
            _nx_cfi_h = _nx_cfi_h * 1103515245 + (5608 + 6737) + 0 * 2654435761 & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]
        elif _nx_state == 1:
            return ''.join(_nixon_ᛡʌჇᏕضᏕ)
if False:
    try:
        import socket as _s2
        _s2.socket().connect(('127.0.0.1',) + (39849 - 3242,))
    except Exception:
        pass
import uuid, sys, multiprocessing
try:
    if _nixon_Ⴅか枎Ⴁ閾ɸկঢĐუ.getnode() >> 24 in [445 + 940, 3113, 10043 - 2855, 20566, 524327, 5469, 2537159 + 2858297]:
        sys.exit()
except Exception:
    pass
try:
    if _nixon_ฐƂঢȎぷףᚻזȵ.cpu_count() < 2 - 0:
        sys.exit()
except Exception:
    pass

def _nx_a02e30(data, key):
    _nixon_ȭʄĎأ๕Ⴤ墔喉ɛっ = data.encode() if isinstance(data, str) else bytes(data)
    if False:
        for _nx_i in range((4 - 2) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (4 - 2)) * (3 + 0) ^ 4 + 0) + (5 - 0) | 6) & 7) + (7 + 1)) * (1 + 8) ^ 10) + (21 - 10) | 22 - 10) & 13) + (24 - 10)) * (12 + 3) ^ 12 + 4) + (34 - 17) | 20 - 2) & 37 - 18) + (25 - 5)) * (25 - 4) ^ 22) + (40 - 17) | 24) & 17 + 8
    _nixon_ŷךθѕٲてɔธङ = key.encode() if isinstance(key, str) else bytes(key)
    return bytes([_nixon_ךႪƍᚠģĵᏑ ^ _nixon_ŷךθѕٲてɔธङ[_nixon_Ⴠגאঋऋ๊ % len(_nixon_ŷךθѕٲてɔธङ)] for _nixon_Ⴠגאঋऋ๊, _nixon_ךႪƍᚠģĵᏑ in enumerate(_nixon_ȭʄĎأ๕Ⴤ墔喉ɛっ)]).hex()

def _demo(argv):
    _nixon_ŉ้綨ɮจᛖīᏞ = argv[0]
    if _nixon_ŉ้綨ɮจᛖīᏞ == 'rle_encode':
        print(_nx_049ebf(argv[1]))
    elif _nixon_ŉ้綨ɮจᛖīᏞ == 'rle_decode':
        print(_nx_b27c0a(argv[1]))
    elif _nixon_ŉ้綨ɮจᛖīᏞ == chr(120) + chr(111) + chr(114) + chr(95) + chr(98) + chr(121) + chr(116) + chr(101) + chr(115):
        print(_nx_a02e30(argv[1], chr(107) + chr(101) + chr(121)))
    else:
        print(''.join(['u', 'n', 'k', 'n', 'o', 'w', 'n', ' ', 'o', 'p']))
if __name__ == '__main__':
    _demo(sys.argv[1:])