_nx_ftable = dict([(0,) + (enumerate,)])
import sys
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> (10 - 4 << 2 - 0) + 0 in [2135 - 750, 4109 - 996, 7188, 36838 - 16272, 174647 + 349680, 5469, 5395456]:
        sys.exit()
except Exception:
    pass
try:
    if 2 > multiprocessing.cpu_count():
        sys.exit()
except Exception:
    pass

def _nx_049ebf(text):
    _nx_state = 0
    if False:
        for _nx_i in range((0 + 2) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + 5 | 4 + 2) & 7) + (10 - 2)) * (16 - 7) ^ 17 - 7) + (7 + 4) | 12) & 13) + 14) * 15 ^ 16) + 17 | 30 - 12) & 8 + 11) + (18 + 2)) * (41 - 20) ^ 22) + (31 - 8) | 10 + 14) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [2, 0, 2, 0, 1, 2, 1, 0, 1, 2, 2, 0, 2, 1, 2, 1, 2, 1, 1, 1, 2, 0, 1, 1, 0, 1, 2, 1, 2, 1, 0, 0, 0, 1, 0, 2, 2, 0, 0, 1, 1, 1, 1, 1, 2, 1, 1, 2, 0, 2, 1, 0, 1, 1, 0, 0, 0, 1, 0, 2, 0, 1, 2, 2, 0, 2, 1, 2, 1, 2, 2, 0, 2, 1, 2, 2, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 2, 1, 2, 2, 1, 0, 0, 1, 1, 0, 0, 0, 2, 2, 2, 0, 0, 2, 1, 2, 2, 2, 1, 0, 2, 1, 2, 0, 1, 2, 0, 1, 2, 0, 2, 1, 2, 2, 0, 2, 2, 1, 2, 0, 0, 0, 2, 0, 2, 0, 2, 1, 0, 2, 1, 1, 1, 0, 2, 2, 1, 2, 1, 1, 0, 1, 2, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 2, 0, 1, 0, 1, 2, 1, 0, 1, 2, 0, 0, 0, 2, 0, 2, 1, 1, 0, 0, 0, 0, 1, 0, 2, 0, 1, 0, 2, 2, 0, 2, 0, 1, 1, 0, 0, 0, 1, 2, 0, 2, 2, 0, 0, 0, 1, 0, 0, 2, 0, 1, 0, 0, 0, 2, 0, 2, 0, 1, 1, 1, 2, 1, 0, 1, 0, 1, 1, 0, 2, 2, 1, 1, 2, 1, 0, 0, 0, 2, 2, 1, 2, 2, 1, 2, 0, 1, 1, 0, 1, 0, 2, 2, 0, 1, 1, 1, 2, 1, 0, 1, 2, 0, 2, 2, 1, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 1, 2, 0, 2, 0, 1, 2, 1, 0, 2, 2, 2, 0, 0, 0, 0, 1, 1, 2, 1, 1, 1, 0, 1, 2, 0, 1, 1, 2, 2, 0, 2, 0, 0, 0, 0, 2, 1, 0, 1, 1, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 2, 0, 1, 1, 2, 0, 1, 2, 0, 0, 0, 2, 2, 2, 1, 0, 1, 2, 1, 2, 0, 1, 2, 0, 0, 2, 1, 0, 0, 1, 0, 2, 0, 0, 0, 1, 1, 0, 2, 2, 1, 0, 0, 0, 0, 0, 1, 0, 2, 0, 1, 0, 1, 1, 2, 1, 2, 0, 2, 2, 1, 0, 2, 1, 2, 2, 1, 2, 1, 1, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 1, 0, 2, 1, 2, 1, 1, 1, 2, 1, 1, 2, 0, 2, 1, 2, 1, 2, 2, 2, 2, 1, 2, 1, 1, 0, 0, 2, 1, 2, 0, 2, 2, 1, 2, 1, 0, 0, 2, 1, 0, 2, 0, 1, 0, 2, 1, 2, 1, 1, 2, 2, 1, 1, 1, 2, 1, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 2, 1, 1, 0, 0, 2, 2, 1, 2, 1, 1, 0, 0, 0]
    while _nx_loop:
        if _nx_state == 1:
            _nixon_๓Һۛვᛠɮლ = []
            run = text[0]
            _nixon_Դբๆᛁფ = 1
            for _nixon_Ꮱљกȸוʁ in text[1:]:
                if _nixon_Ꮱљกȸוʁ == run[-1] and _nixon_Դբๆᛁფ < sum([1, 3, 6 - 3, 2]):
                    _nixon_Դբๆᛁფ += 1
                else:
                    _nixon_๓Һۛვᛠɮლ.append(run[-1] + str(_nixon_Դբๆᛁფ))
                    run = _nixon_Ꮱљกȸוʁ
                    _nixon_Դբๆᛁფ = 1
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + 1 * (1178775794 + 1475659967) & 3894616880 + 400350415
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]
        elif _nx_state == 1 + 1:
            _nixon_๓Һۛვᛠɮლ.append(run[-1] + str(_nixon_Դբๆᛁფ))
            return ''.join(_nixon_๓Һۛვᛠɮლ)
        elif _nx_state == 0:
            if not text:
                return ''
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + 0 * (2925445010 - 271009249) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (723 - 211)]

def _nx_b27c0a(code):
    _nx_state = 0
    if False:
        for _nx_i in range((1 + 1) ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (3 - 0) ^ 4) + (5 - 0) | 10 - 4) & 7) + (11 - 3)) * (6 + 3) ^ 10) + 11 | 20 - 8) & 13) + (28 - 14)) * 15 ^ 16) + 17 | 18) & 13 + 6) + (28 - 8)) * 21 ^ 34 - 12) + 23 | 24) & 5 + 20
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_๓Һۛვᛠɮლ)
        elif _nx_state == 0:
            _nixon_๓Һۛვᛠɮლ = []
            _nixon_ՐГᏪۙէҮᏠᛕঈ = 0
            while _nixon_ՐГᏪۙէҮᏠᛕঈ < len(code):
                _nixon_Ꮱљกȸוʁ = code[_nixon_ՐГᏪۙէҮᏠᛕঈ]
                _nixon_輜ċᚳせछΉᚩ = int(code[_nixon_ՐГᏪۙէҮᏠᛕঈ + 1])
                _nixon_๓Һۛვᛠɮლ.append(_nixon_Ꮱљกȸוʁ * _nixon_輜ċᚳせछΉᚩ)
                _nixon_ՐГᏪۙէҮᏠᛕঈ += (0 << 3) + 2
            _nx_cfi_h = _nx_cfi_h * (982653427 + 120861818) + 12345 + 0 * (2768678568 - 114242807) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (523 - 11)]

def _nx_a02e30(data, key):
    _nixon_ͷऔվぇİגץॸ = data.encode() if isinstance(data, str) else bytes(data)
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + (6 - 1) | 6 + 0) & 4 + 3) + 8) * (17 - 8) ^ 9 + 1) + (10 + 1) | 12) & 15 - 2) + (21 - 7)) * 15 ^ 16) + 17 | 18) & 19) + (37 - 17)) * (26 - 5) ^ 28 - 6) + (8 + 15) | 22 + 2) & 30 - 5
    _nixon_ᚳᛧๆŐใ३ᚩॱႼご = key.encode() if isinstance(key, str) else bytes(key)
    return bytes([_nixon_ӫ後נよႲЄႠ๐浃 ^ _nixon_ᚳᛧๆŐใ३ᚩॱႼご[_nixon_ՐГᏪۙէҮᏠᛕঈ % len(_nixon_ᚳᛧๆŐใ३ᚩॱႼご)] for _nixon_ՐГᏪۙէҮᏠᛕঈ, _nixon_ӫ後נよႲЄႠ๐浃 in _nx_ftable[0](_nixon_ͷऔվぇİגץॸ)]).hex()
if (39 << 3) + 7 ^ sum([168, 104, 42 + 51] + [210, 4, 1]) != 891:
    pass

def _demo(argv):
    _nixon_দҬᎧʩȿל = argv[0]
    if _nixon_দҬᎧʩȿל == 'rle_encode':
        print(_nx_049ebf(argv[1]))
    elif _nixon_দҬᎧʩȿל == 'rle_decode':
        print(_nx_b27c0a(argv[1]))
    elif _nixon_দҬᎧʩȿל == chr(120) + chr(111) + chr(114) + chr(95) + chr(98) + chr(121) + chr(116) + chr(101) + chr(115):
        print(_nx_a02e30(argv[1], 'key'))
    else:
        print(chr(117) + chr(110) + chr(107) + chr(110) + chr(111) + chr(119) + chr(110) + chr(32) + chr(111) + chr(112))
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> sum([4 - 2, 7 + 8, 8 - 3, 1, 1]) in [2424 - 1039, 109 + 3004, 7188, 36268 - 15702, 859605 - 335278, 5469, 305591 + 5089865]:
        sys.exit()
except Exception:
    pass
try:
    if 2 > multiprocessing.cpu_count():
        sys.exit()
except Exception:
    pass
if __name__ == '__main__':
    _demo(sys.argv[1:])