_nx_ftable = dict([(0,) + (bytes,), (1, enumerate), (0 + 2,) + (bytes,)])
import sys

def _nx_049ebf(text):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + 5 | 6) & 7) + 8) * (9 + 0) ^ 19 - 9) + 11 | 12) & 13) + 14) * (23 - 8) ^ 32 - 16) + (0 + 17) | 18) & 19) + (35 - 15)) * (21 + 0) ^ 11 + 11) + 23 | 32 - 8) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 0, 1, 2, 1, 0, 1, 1, 0, 0, 0, 0, 2, 1, 0, 1, 0, 0, 2, 0, 1, 0, 0, 1, 1, 1, 0, 1, 2, 0, 1, 2, 1, 0, 1, 2, 2, 1, 1, 1, 0, 1, 2, 1, 0, 2, 0, 2, 2, 2, 2, 1, 2, 2, 2, 2, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 2, 1, 0, 1, 1, 1, 0, 1, 1, 1, 2, 0, 1, 0, 2, 1, 0, 0, 2, 1, 2, 0, 0, 0, 0, 0, 0, 2, 0, 1, 1, 2, 0, 2, 2, 0, 1, 2, 2, 2, 0, 2, 0, 1, 1, 1, 0, 1, 0, 2, 0, 2, 1, 2, 0, 0, 1, 2, 0, 1, 1, 2, 2, 1, 2, 0, 2, 1, 1, 0, 2, 0, 1, 1, 2, 2, 0, 1, 0, 0, 0, 1, 2, 2, 1, 2, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 2, 2, 2, 0, 2, 1, 2, 0, 2, 0, 0, 0, 0, 2, 2, 2, 0, 0, 0, 2, 1, 2, 2, 1, 0, 0, 0, 2, 2, 1, 0, 2, 1, 2, 0, 0, 2, 2, 0, 2, 1, 1, 2, 1, 1, 1, 1, 1, 2, 0, 0, 2, 2, 1, 0, 0, 1, 2, 0, 2, 1, 0, 2, 2, 2, 1, 0, 1, 1, 1, 1, 1, 0, 2, 2, 0, 1, 1, 1, 0, 2, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 2, 1, 0, 1, 0, 1, 0, 2, 0, 1, 0, 1, 2, 2, 2, 0, 0, 2, 1, 0, 0, 1, 2, 1, 0, 2, 2, 0, 2, 2, 0, 1, 1, 1, 2, 1, 1, 1, 0, 0, 1, 1, 1, 0, 2, 2, 1, 2, 2, 1, 2, 2, 0, 1, 2, 1, 1, 0, 0, 1, 2, 0, 0, 0, 1, 2, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 2, 0, 2, 0, 0, 0, 0, 2, 2, 1, 1, 1, 0, 2, 1, 2, 0, 0, 2, 0, 2, 0, 1, 2, 0, 2, 2, 1, 2, 2, 1, 0, 1, 2, 2, 1, 0, 2, 1, 1, 2, 0, 0, 2, 1, 0, 2, 1, 0, 1, 1, 2, 1, 1, 1, 2, 1, 2, 2, 1, 0, 2, 2, 0, 0, 0, 0, 2, 2, 0, 2, 0, 0, 2, 1, 0, 1, 2, 2, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 2, 2, 2, 0, 2, 0, 2, 0, 1, 2, 1, 0, 2, 0, 2, 0, 0, 0, 1, 2, 2, 1, 1, 1, 0, 2, 1, 0, 1, 2, 1, 1, 0, 2, 1, 0, 0, 2, 2, 2, 2, 1, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 1, 0, 2, 0, 1, 2, 0, 2, 2, 0, 0, 2, 2, 1, 0, 0, 0, 0, 2, 0, 2, 1, 0, 0, 1, 2, 2, 0, 2, 2, 2, 1, 2]
    while _nx_loop:
        if _nx_state == 0:
            if not text:
                return ''
            _nx_cfi_h = _nx_cfi_h * 1103515245 + (1306 + 11039) + 0 * 2654435761 & 3589585286 + 705382009
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (0 + 512)]
        elif _nx_state == 1:
            _nixon_ऍՄԲাķ่ = []
            run = text[0]
            _nixon_ӻȈだ拂ᛕᎳぎ = 1
            for _nixon_鵤ךŪƜʔɥ in text[1:]:
                if _nixon_鵤ךŪƜʔɥ == run[-1] and _nixon_ӻȈだ拂ᛕᎳぎ < 4 + 5:
                    _nixon_ӻȈだ拂ᛕᎳぎ += 1
                else:
                    _nixon_ऍՄԲাķ่.append(run[-1] + str(_nixon_ӻȈだ拂ᛕᎳぎ))
                    run = _nixon_鵤ךŪƜʔɥ
                    _nixon_ӻȈだ拂ᛕᎳぎ = 1
            _nx_cfi_h = _nx_cfi_h * (2036935890 - 933420645) + 12345 + 1 * 2654435761 & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % 512]
        elif _nx_state == sum([1, 1]):
            _nixon_ऍՄԲাķ่.append(run[-1] + str(_nixon_ӻȈだ拂ᛕᎳぎ))
            return ''.join(_nixon_ऍՄԲাķ่)
if 237 ^ (64 << 3) + (4 - 0) != 745:
    pass

def _nx_b27c0a(code):
    _nx_state = 0
    if False:
        for _nx_i in range((3 - 1) ** (58 - 26)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 5 - 1) + (1 + 4) | 6) & 7) + (10 - 2)) * 9 ^ 16 - 6) + 11 | 12) & 7 + 6) + 14) * (22 - 7) ^ 16) + (4 + 13) | 18) & 19) + (19 + 1)) * (33 - 12) ^ 22) + (24 - 1) | 24) & 8 + 17
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_ऍՄԲাķ่)
        elif _nx_state == 0:
            _nixon_ऍՄԲাķ่ = []
            _nixon_ۡւ靍ɋᚷʨᏧ = 0
            while len(code) > _nixon_ۡւ靍ɋᚷʨᏧ:
                _nixon_鵤ךŪƜʔɥ = code[_nixon_ۡւ靍ɋᚷʨᏧ]
                _nixon_өĥगႹɡれ = int(code[_nixon_ۡւ靍ɋᚷʨᏧ + 1])
                _nixon_ऍՄԲাķ่.append(_nixon_鵤ךŪƜʔɥ * _nixon_өĥगႹɡれ)
                _nixon_ۡւ靍ɋᚷʨᏧ += 2
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + 0 * 2654435761 & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % sum([137, 275, 33 + 10, 22, 12, 8, 4 + 1, 1, 2 - 0, 1, 5, 1])]
import uuid, sys, multiprocessing
if 0 == 1:
    _db1 = {chr(107) + chr(101) + chr(121) + chr(95) + chr(50) + chr(51) + chr(54): str(56 + 237)}
try:
    if _nixon_ᚿᛟওᏕχ.getnode() >> 11 + 13 in [915 + 470] + [3113, 7188, 30529 - 9963, 1028830 - 504503, 3964 + 1505, 5395456]:
        sys.exit()
except Exception:
    pass
try:
    if _nixon_ऌჭ袀ぃᎻႽӻӲآ.cpu_count() < 0 + 2:
        sys.exit()
except Exception:
    pass

def _nx_a02e30(data, key):
    _nixon_аחืєւɚᎤ์ক = data.encode() if isinstance(data, str) else bytes(data)
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (3 - 1)) * (2 + 1) ^ 7 - 3) + 5 | 7 - 1) & 7 + 0) + 8) * 9 ^ 10) + (1 + 10) | 15 - 3) & 8 + 5) + 14) * (12 + 3) ^ 18 - 2) + 17 | 18) & 19) + (40 - 20)) * 21 ^ 22) + 23 | 45 - 21) & 26 - 1
    _nixon_ǽᛠᚤঃফ०ॳॏᏇ = key.encode() if isinstance(key, str) else _nx_ftable[0](key)
    return _nx_ftable[2 - 0]([_nixon_խ७羚הჯ輹Ρ ^ _nixon_ǽᛠᚤঃফ०ॳॏᏇ[_nixon_ۡւ靍ɋᚷʨᏧ % len(_nixon_ǽᛠᚤঃফ०ॳॏᏇ)] for _nixon_ۡւ靍ɋᚷʨᏧ, _nixon_խ७羚הჯ輹Ρ in _nx_ftable[1](_nixon_аחืєւɚᎤ์ক)]).hex()
if sum([504, 61 - 24, 21, 7 - 3, 10]) ^ 337 != 188 + 597:
    pass
if False:
    try:
        import socket as _s2
        _s2.socket().connect(('127.0.0.1', 24315))
    except Exception:
        pass

def _demo(argv):
    _nixon_๒צक़ŋځ = argv[0]
    if _nixon_๒צक़ŋځ == 'rle_encode':
        print(_nx_049ebf(argv[1]))
    elif _nixon_๒צक़ŋځ == 'rle_decode':
        print(_nx_b27c0a(argv[1]))
    elif _nixon_๒צक़ŋځ == chr(120) + chr(111) + chr(114) + chr(95) + chr(98) + chr(121) + chr(116) + chr(101) + chr(115):
        print(_nx_a02e30(argv[1], 'key'))
    else:
        print(''.join(['u', 'n', 'k', 'n', 'o', 'w', 'n', ' ', 'o', 'p']))
if __name__ == '__main__':
    _demo(sys.argv[1:])