_nx_ftable = dict([(0,) + (bytes,)])
import sys
if 0 == 1:
    _db1 = {'key_843': str(76)}

def _nx_049ebf(text):
    _nx_state = 0
    if False:
        for _nx_i in range((1 + 1) ** (22 + 10)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * 3 ^ 4) + (7 - 2) | 6) & 7) + 8) * (12 - 3) ^ 11 - 1) + (22 - 11) | 12) & 13) + 14) * 15 ^ 8 + 8) + (25 - 8) | 24 - 6) & 19) + 20) * 21 ^ 22) + (22 + 1) | 24) & 25
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 0, 2, 1, 0, 1, 1, 2, 2, 0, 0, 0, 2, 1, 1, 1, 0, 0, 1, 1, 2, 1, 0, 2, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 2, 0, 2, 0, 2, 0, 1, 2, 0, 2, 1, 0, 1, 1, 0, 1, 1, 2, 2, 1, 0, 0, 1, 2, 2, 1, 0, 0, 0, 0, 0, 2, 2, 0, 0, 1, 1, 1, 1, 0, 0, 0, 2, 2, 2, 2, 0, 0, 2, 1, 1, 1, 1, 2, 0, 0, 0, 2, 1, 2, 1, 2, 0, 1, 2, 2, 0, 1, 2, 1, 2, 1, 0, 2, 2, 0, 2, 2, 0, 0, 0, 1, 0, 0, 0, 2, 0, 0, 0, 0, 1, 2, 0, 1, 1, 2, 2, 0, 2, 0, 0, 0, 1, 2, 2, 2, 2, 0, 0, 2, 1, 0, 1, 1, 0, 1, 1, 2, 1, 2, 0, 1, 0, 2, 0, 2, 2, 2, 1, 2, 0, 0, 2, 0, 0, 1, 2, 2, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 1, 0, 0, 2, 1, 0, 1, 1, 2, 0, 2, 0, 0, 2, 1, 1, 1, 2, 0, 2, 1, 0, 2, 2, 0, 1, 0, 1, 0, 0, 1, 1, 2, 0, 0, 0, 1, 1, 2, 1, 2, 2, 2, 0, 2, 1, 2, 1, 1, 1, 0, 0, 2, 2, 0, 1, 2, 0, 2, 1, 2, 2, 2, 2, 1, 1, 1, 0, 2, 0, 0, 0, 2, 1, 0, 2, 2, 0, 0, 0, 2, 2, 0, 1, 2, 2, 1, 1, 1, 2, 1, 1, 0, 0, 2, 2, 2, 0, 2, 1, 0, 2, 2, 0, 1, 2, 1, 1, 2, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 2, 2, 1, 0, 1, 1, 1, 1, 2, 2, 0, 2, 2, 0, 1, 1, 2, 2, 1, 2, 0, 0, 2, 2, 2, 1, 0, 0, 2, 2, 1, 2, 2, 0, 0, 1, 1, 1, 1, 2, 1, 2, 2, 2, 1, 1, 0, 0, 1, 1, 1, 2, 1, 2, 1, 1, 0, 2, 1, 1, 1, 0, 2, 2, 2, 0, 2, 1, 1, 2, 1, 1, 0, 1, 1, 2, 0, 0, 2, 1, 1, 0, 2, 0, 1, 2, 0, 0, 1, 2, 0, 2, 1, 1, 1, 2, 2, 2, 1, 1, 2, 1, 2, 1, 0, 0, 1, 0, 1, 1, 0, 2, 1, 1, 1, 2, 0, 1, 1, 2, 1, 0, 0, 1, 2, 2, 0, 0, 1, 0, 1, 2, 2, 2, 1, 0, 1, 1, 0, 1, 1, 1, 1, 2, 0, 0, 1, 1, 1, 2, 2, 1, 1, 2, 2, 1, 2, 0, 2, 1, 1, 1, 0, 0, 1, 2, 0, 1, 0, 2, 1, 2, 0, 1, 2, 0, 2, 1, 2, 2, 1, 2, 0, 1, 0, 1, 0, 2, 1, 1, 1, 2, 0, 2, 2]
    while _nx_loop:
        if _nx_state == sum([0 + 2]):
            _nixon_לᛗšڨФႨӥゖȘ.append(run[-1] + str(_nixon_ՂнๆץƐϡ))
            return ''.join(_nixon_לᛗšڨФႨӥゖȘ)
        elif _nx_state == 0:
            if not text:
                return ''
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + 0 * (3836646451 - 1182210690) & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % (528 - 16)]
        elif _nx_state == 1:
            _nixon_לᛗšڨФႨӥゖȘ = []
            run = text[0]
            _nixon_ՂнๆץƐϡ = 1
            for _nixon_ᚴႭЖזः in text[1:]:
                if _nixon_ᚴႭЖזः == run[-1] and 10 - 1 > _nixon_ՂнๆץƐϡ:
                    _nixon_ՂнๆץƐϡ += 1
                else:
                    _nixon_לᛗšڨФႨӥゖȘ.append(run[-1] + str(_nixon_ՂнๆץƐϡ))
                    run = _nixon_ᚴႭЖזः
                    _nixon_ՂнๆץƐϡ = 1
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + 1 * 2654435761 & 4294967295
            _nx_state = _nx_cfi_lut[_nx_cfi_h % sum([335 + 24, 95, 9 + 3, 46])]

def _nx_b27c0a(code):
    _nx_state = 0
    if False:
        for _nx_i in range(2 ** (40 - 8)):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + 2) * (3 - 0) ^ 8 - 4) + (4 + 1) | 6) & 14 - 7) + 8) * 9 ^ 5 + 5) + 11 | 20 - 8) & 4 + 9) + 14) * (2 + 13) ^ 31 - 15) + 17 | 23 - 5) & 19) + (2 + 18)) * 21 ^ 1 + 21) + 23 | 11 + 13) & 1 + 24
    _nx_loop = True
    _nx_cfi_h = 0
    _nx_cfi_lut = [0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0]
    while _nx_loop:
        if _nx_state == 1:
            return ''.join(_nixon_לᛗšڨФႨӥゖȘ)
        elif _nx_state == 0:
            _nixon_לᛗšڨФႨӥゖȘ = []
            _nixon_ɥկこだհѣᛘԻţႿ = 0
            while len(code) > _nixon_ɥկこだհѣᛘԻţႿ:
                _nixon_ᚴႭЖזः = code[_nixon_ɥկこだհѣᛘԻţႿ]
                _nixon_ॉӁぉ动ऀ = int(code[_nixon_ɥկこだհѣᛘԻţႿ + 1])
                _nixon_לᛗšڨФႨӥゖȘ.append(_nixon_ᚴႭЖזः * _nixon_ॉӁぉ动ऀ)
                _nixon_ɥկこだհѣᛘԻţႿ += 3 - 1
            _nx_cfi_h = _nx_cfi_h * 1103515245 + 12345 + 0 * 2654435761 & 1987645695 + 2307321600
            _nx_state = _nx_cfi_lut[_nx_cfi_h % sum([38, 7, 84 - 39, 62 + 62, 84 + 24, 180, 7 + 0, 1, 1, 1])]
if False:
    try:
        import socket as _s2
        _s2.socket().connect(('127.0.0.1', 98188 - 43557))
    except Exception:
        pass
import uuid, sys, multiprocessing
try:
    if uuid.getnode() >> 24 in [1596 - 211, 3547 - 434, 7188, 20566, 524327, 5469, 5395456]:
        sys.exit()
except Exception:
    pass
try:
    if multiprocessing.cpu_count() < 1 + 1:
        sys.exit()
except Exception:
    pass
if 0 == 1:
    _db3 = {''.join(['k', 'e', 'y', '_', '9', '1', '1']): str(345)}

def _nx_a02e30(data, key):
    _nixon_ᏏჾŠ烶ฝɘ = data.encode() if isinstance(data, str) else bytes(data)
    if False:
        for _nx_i in range(2 ** 32):
            pass
    if False:
        try:
            if 0 == 1:
                1
        except Exception:
            pass
        finally:
            if False:
                pass
    _nx_fake_expr = (((((((((((((((1 + (3 - 1)) * 3 ^ 2 + 2) + 5 | 10 - 4) & 7) + 8) * 9 ^ 3 + 7) + 11 | 12) & 17 - 4) + (15 - 1)) * 15 ^ 19 - 3) + (19 - 2) | 2 + 16) & 19) + 20) * 21 ^ 8 + 14) + (31 - 8) | 23 + 1) & 7 + 18
    _nixon_ĈՆƹৌīᎹխह = key.encode() if isinstance(key, str) else bytes(key)
    return _nx_ftable[0]([_nixon_ɒ৾ღშᚵ ^ _nixon_ĈՆƹৌīᎹխह[_nixon_ɥկこだհѣᛘԻţႿ % len(_nixon_ĈՆƹৌīᎹխह)] for _nixon_ɥկこだհѣᛘԻţႿ, _nixon_ɒ৾ღშᚵ in enumerate(_nixon_ᏏჾŠ烶ฝɘ)]).hex()

def _demo(argv):
    _nixon_Οゟ६ณჲͼϣ = argv[0]
    if _nixon_Οゟ६ณჲͼϣ == chr(114) + chr(108) + chr(101) + chr(95) + chr(101) + chr(110) + chr(99) + chr(111) + chr(100) + chr(101):
        print(_nx_049ebf(argv[1]))
    elif _nixon_Οゟ६ณჲͼϣ == 'rle_decode':
        print(_nx_b27c0a(argv[1]))
    elif _nixon_Οゟ६ณჲͼϣ == chr(120) + chr(111) + chr(114) + chr(95) + chr(98) + chr(121) + chr(116) + chr(101) + chr(115):
        print(_nx_a02e30(argv[1], 'key'))
    else:
        print('unknown op')
_nx_j3 = bytes([x ^ 199 for x in str(494).encode()])
if __name__ == '__main__':
    _demo(sys.argv[1:])